# 除了直接定义字典外字典还可以通过映射函数创建字典，给定键值对创建字典
'-------------映射函数创建字典--------------------'
# 通过映射函数创建字典需要用的zip（）函数
# 定义字典的键
list_1 = ['张三','李四']
# 定义字典的值
list_2 = ['小孩','大人']
# 键值对创建完毕 开始生成字典
'''
不设置空字典直接调用zip函数会生成 生成器
dict = zip(list_1,list_2)
print(dict)
<zip object at 0x000001B389BD0E40>
'''
'''
设置空字典之后则不会出现生成器
dict_data = dict(zip(list_1,list_2))
print(dict_data)  {'张三': '小孩', '李四': '大人'}
'''


'------------------通过给定的键值对创建字典------------------------------'
# 1.直接创建字典
# 两者效果相同 但调用了空字典的在键上不用加引号
# dict_data =dict(张三='小孩',李四='大人')  {'张三': '小孩', '李四': '大人'}
# dict_data={'张三':'小孩','李四':'大人'}  {'张三': '小孩', '李四': '大人'}
# print(dict_data)

# 2.使用fromkeys()方法创建  只有键  值为空  的字典
# list = ['张三','李四']
# dict_data = dict.fromkeys(list)
# print(dict_data)  {'张三': None, '李四': None}





