# 列表推导式可以快速生成一个列表，或者根据某个列表生成满足指定要求的列表
# 定义列表 元素为i循环赋值5次的数据
a = [i for i in range(5)]
# print(a)   [0, 1, 2, 3, 4]
'-----------------生成指定范围的数值列表----------------------'
# 导入随机模块
import random
# 自定义一个列表  要求为随机数字范围是10到100    循环次数为10次
# list = [random.randint(10,100) for i in range(10)]
# print(list)   [52, 57, 33, 83, 44, 49, 18, 78, 72, 47]


'----------------生成指定要求的列表----------------------------'
# 定义列表
# price = [100,20,510,521,666]
# 生成的新列表 列表的要求  新列表的数据是的旧列表数据
# new_price = [price*0.5 for price in price]
#                           类型为浮点型 float
# print(new_price)   [50.0, 10.0, 255.0, 260.5, 333.0]
#                            类型为整数型  int
# new_price = [int(price*0.5) for price in price]
# print(new_price)   [50, 10, 255, 260, 333]


'---------------从列表中选择符合条件的元素形成新列表-------------------------------------'
# 定义列表
# price = [100,20,510,521,666]
# 生成的新列表  i是新列表的数据  i数据是从price数据中循环来的  如果数据i从数据price赋值过来的元素满足数值大于500就将它存放到新列表
# new_price = [i for i in price if i>500]
# 打印新列表
# print(new_price)   [510, 521, 666]